# 시리즈 만들기

In [9]:
df1=pd.Series(['A','B'],index=['C','D'])
df1

C    A
D    B
dtype: object

# 데이터프레임 만들기

In [10]:
df2 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

# 데이터프레임에서 시리즈 선택하기

In [17]:
df2.loc[1,]
type(df2.loc[1,])

pandas.core.series.Series

# index, values 사용하기

In [ ]:
##???

# 시리즈의 mean, min, max, std 메서드 사용하기

In [18]:
df2["data2"].mean()

30.0

In [19]:
df2["data2"].min()

10

In [20]:
df2["data2"].max()

50

In [21]:
df2["data2"].std()

15.811388300841896

# 시리즈와 불린 추출 사용하기

In [29]:
import pandas as pd
scientists = pd.read_csv('pandas_data/scientists.csv')
scientists
#Age열에 대해 평균보다 큰 age만(데이터) 추출

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [30]:
scientists['Age'].mean()

59.125

In [31]:
scientists[scientists['Age']>59.125]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

# 시리즈와 브로드캐스팅

In [40]:
# age열에 대해 모두 +10 *2 ... 연산
scientists['Age']*2
scientists['Age']+10
scientists['Age']*2/scientists['Age']+10

0    12.0
1    12.0
2    12.0
3    12.0
4    12.0
5    12.0
6    12.0
7    12.0
Name: Age, dtype: float64

# 열의 자료형 바꾸기와 새로운 열 추가하기

In [33]:
scientists['Age'].astype(object)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: object

# 데이터프레임의 열 삭제하기

In [24]:
scientists.drop(['Born'],axis=1)

                   Name        Died  Age          Occupation
0     Rosaline Franklin  1958-04-16   37             Chemist
1        William Gosset  1937-10-16   61        Statistician
2  Florence Nightingale  1910-08-13   90               Nurse
3           Marie Curie  1934-07-04   66             Chemist
4         Rachel Carson  1964-04-14   56           Biologist
5             John Snow  1858-06-16   45           Physician
6           Alan Turing  1954-06-07   41  Computer Scientist
7          Johann Gauss  1855-02-23   77       Mathematician